# SymbolicCurveArray Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolicCurveArray Constructor
SymbolicCurveArray Class See Also
---
Initializes a new instance of the SymbolicCurveArray class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public SymbolicCurveArray()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
SymbolicCurveArray()
```

# See Also
SymbolicCurveArray Class
Autodesk.Revit.DB Namespace